//
//  Category.swift
//  Alias
//
//  Created by Кирилл  Геллерт on 03.05.2022.
//

import Foundation

struct Category {
    
    let title: String
    let imageName: String?
    let cards: [String]
    var isSelected: Bool
    
    init(title: String, image: String?, cards: [String]) {
        self.title = title
        self.imageName = image
        self.cards = cards
        self.isSelected = false
    }
    
    mutating func toggleSelection() {
        isSelected.toggle()
    }
    
    static func getCategories() -> [Category] {
        return [Category(title: "Базовый набор",
                         image: "base",
                         cards: ["Футбол",
                                 "Каша",
                                "Карандаш",
                                "Тигр",
                                "Автобус",
                                "Прекрасный",
                                "Роза",
                                "Учитель",
                                "Автогонки",
                                "Рыба",
                                "Трава",
                                "Ракета",
                                "Москва",
                                "Слабый",
                                "Диван",
                                "Выгода"]),
                
                Category(title: "Наука",
                         image: "science",
                         cards: ["Восприятие",
                                 "Бактерия",
                                "График",
                                "Косинус",
                                "Вектор",
                                "Данные",
                                "Принцип суперпозиции",
                                "Диссертация",
                                "Колба",
                                "Предположение",
                                "Доцент",
                                "Пестик",
                                "Химический элемент",
                                "Плюс",
                                "Комета",
                                "Статистика"]),
                
                Category(title: "Новогодний",
                         image: "christmas",
                         cards: ["Загадать желание",
                                 "Январь",
                                "Обратный отсчет",
                                "Дед мороз",
                                "Снегурочка",
                                "Посох",
                                "Елочная игрушка",
                                "Елка",
                                "Подарок",
                                "Иголка",
                                "Подарочная упаковка",
                                "Снег",
                                "Кока кола",
                                "Гирлянда",
                                "Шар",
                                "Колпак"]),
                
                Category(title: "Растения",
                         image: "plants",
                         cards: ["Инжир",
                                 "Алоэ",
                                 "Календула",
                                 "Георгина",
                                 "Крокус",
                                 "Сельдерей",
                                 "Жирянка",
                                 "Мимоза",
                                 "Гортензия",
                                 "Тысячелистник",
                                 "Свекла",
                                 "Мать-и-мачеха",
                                 "Лютик",
                                 "Сирень",
                                 "Рис",
                                 "Водяной перец",
                                 "Мята"]),
                
                Category(title: "Вселенная Толкиена",
                         image: "tolkien",
                         cards: ["Средиземье",
                                 "Хоббит",
                                 "Мордор",
                                 "Леголас",
                                 "Крокус",
                                 "Рохан",
                                 "Эльф",
                                 "Кольцо бессмертия",
                                 "Бильбо",
                                 "Гендальф",
                                 "Око Саурона",
                                 "Саурон",
                                 "Паук"]),
                
                Category(title: "Литературные герои",
                         image: "literatureheroes",
                         cards: ["Граф Дракула",
                                 "Белоснежка",
                                "Колобок",
                                "Снежная королева",
                                "Герда",
                                "Кай",
                                "Русалочка",
                                "Баба Яга"]),
                
                Category(title: "Хайп",
                         image: "hype",
                         cards: ["Слава КПСС",
                                 "Квадрокоптер",
                                "Спиннер",
                                "Гироскутер",
                                "Дратути",
                                "Превет Медвед",
                                "Вспомнил прослезился"]),
                
                Category(title: "Знаменитые личности",
                         image: "famous",
                         cards: ["Джонни Депп",
                                 "Бред Питт",
                                 "Анджелина Джоли",
                                 "Кира Найтли",
                                 "Натали Портман",
                                 "Том Хэнкс",
                                 "Брэдли Купер",
                                 "Ирина Шейк",
                                 "Кайли Дженнер",
                                 "Тайлер Скотт",
                                 "Кристиана Ранальда"]),
                
                Category(title: "Вселенная Marvel",
                         image: "marvel",
                         cards: ["Человек паук",
                                 "Халк",
                                 "Черная вдова",
                                 "Человек муравей"]),
                
                Category(title: "Вселенная DC",
                         image: "dc",
                         cards: ["Хранитель", "Харли Квин"]),
        ]
    }
    
}
